

{{ log("%s - %s"|format("Hello?", "Foo!"), info=True) }}


{% macro bm_sql_comment(table_name, table_cn_name, pk_lst, author) %}

{% set cur_dt = dbt_utils.pretty_time('%Y%m%d') %}
{% set comment_module = """/********************************************************************************************************
数据库表: %s
内容描述：%s
主键：%s
---------------------------------------------------------------------------------------------------------
上线版本     上线日期      修改人    修改内容                  
v1.0        %s      %s    新增
---------------------------------------------------------------------------------------------------------
********************************************************************************************************/""" | format(table_name, table_cn_name, pk_lst, cur_dt, author) %}

{{ log(comment_module, info=False) }}

{{ return(comment_module) }}

{% endmacro %}

